[
  {
    "name": "Jawaharlal Nehru",
    "term": "15 August 1947 - 27 May 1964",
    "details": "First Prime Minister of India, a key figure in the Indian independence movement, and a prominent leader in the establishment of the Republic of India."
  },
  {
    "name": "Gulzarilal Nanda",
    "term": "27 May 1964 - 9 June 1964",
    "details": "Served as the Acting Prime Minister after the death of Jawaharlal Nehru."
  },
  {
    "name": "Lal Bahadur Shastri",
    "term": "9 June 1964 - 11 January 1966",
    "details": "Second Prime Minister of India, known for promoting the White Revolution and leading the country during the Indo-Pakistani war of 1965."
  },
  {
    "name": "Gulzarilal Nanda",
    "term": "11 January 1966 - 24 January 1966",
    "details": "Served again as the Acting Prime Minister after Lal Bahadur Shastri's sudden death."
  },
  {
    "name": "Indira Gandhi",
    "term": "24 January 1966 - 24 March 1977",
    "details": "First female Prime Minister of India, known for her centralization of power and decisive leadership during the Indo-Pakistani War of 1971."
  },
  {
    "name": "Morarji Desai",
    "term": "24 March 1977 - 28 July 1979",
    "details": "Prime Minister from the Janata Party, known for his reformist stance, the first non-Congress PM."
  },
  {
    "name": "Charan Singh",
    "term": "28 July 1979 - 14 January 1980",
    "details": "Prime Minister for a short period, leading a minority government."
  },
  {
    "name": "Indira Gandhi",
    "term": "14 January 1980 - 31 October 1984",
    "details": "Returned to power after the 1977 defeat, her second tenure was marked by Operation Blue Star and her assassination."
  },
  {
    "name": "Rajiv Gandhi",
    "term": "31 October 1984 - 2 December 1989",
    "details": "Youngest Prime Minister of India, his tenure saw significant advancements in technology and telecommunications."
  },
  {
    "name": "Vishwanath Pratap Singh",
    "term": "2 December 1989 - 10 November 1990",
    "details": "Prime Minister who implemented the Mandal Commission recommendations for reservation of jobs for OBCs."
  },
  {
    "name": "Chandra Shekhar",
    "term": "10 November 1990 - 21 June 1991",
    "details": "Served as Prime Minister during a period of political instability and a minority government."
  },
  {
    "name": "P. V. Narasimha Rao",
    "term": "21 June 1991 - 16 May 1996",
    "details": "Credited with economic liberalization and reforms that transformed India's economy."
  },
  {
    "name": "Atal Bihari Vajpayee",
    "term": "16 May 1996 - 1 June 1996",
    "details": "First tenure as PM, a short-lived minority government."
  },
  {
    "name": "H. D. Deve Gowda",
    "term": "1 June 1996 - 21 April 1997",
    "details": "Prime Minister leading a coalition government, focused on agricultural reforms."
  },
  {
    "name": "Inder Kumar Gujral",
    "term": "21 April 1997 - 19 March 1998",
    "details": "Known for the 'Gujral Doctrine' in India's foreign policy."
  },
  {
    "name": "Atal Bihari Vajpayee",
    "term": "19 March 1998 - 22 May 2004",
    "details": "Second term as Prime Minister, his tenure was marked by significant economic growth and the Kargil War."
  },
  {
    "name": "Manmohan Singh",
    "term": "22 May 2004 - 26 May 2014",
    "details": "Economist known for his role in economic reforms and liberalization in the 1990s, his tenure saw significant economic growth."
  },
  {
    "name": "Narendra Modi",
    "term": "26 May 2014 - Present",
    "details": "Current Prime Minister, known for his policies like Make in India, Digital India, Swachh Bharat, and demonetization."
  }
]
